{
  "_meta": {
    "sources": [
      {
        "abbreviation": "AGI",
        "authors": [
          "Aspy"
        ],
        "color": "1CC41C",
        "convertedBy": [],
        "full": "Aspy's Guide to Infinitum",
        "json": "AspysGuidetoInfinitum"
      }
    ],
    "optionalFeatureTypes": {
      "GS": "Gunblade Stance",
      "CW": "Chronomancer Wells"
    },
    "dateAdded": 0,
    "dateLastModified": 0
  },
  "item": [
    {
      "name": "(Asmodeus) Soulbinder, The Infernal Code of Conduct",
      "source": "AspysGuidetoInfinitum",
      "rarity": "artifact",
      "wondrous": true,
      "property": [
        "AGI:AS",
        "AGI:A"
      ],
      "reqAttune": "By a devout champion of Asmodeus",
      "entries": [
        "Soulbinder is a tome of unspeakable law and dark contracts, its pages made from the skins of damned souls, rules penned by Pyreclaw, the eternal punisher. Pages of this tome are bound together with chains that smolder with incredible heat. This accursed volume stands as a testament to Asmodeus's supremacy over all pacts and a conduit for his acolytes to channel the depths of infernal jurisprudence.",
        "The tome provides a +3 bonus to spell attack rolls and spell save DCs. Spells and cantrips unleashed from this tome inflict an additional {@dice 1d8} fire damage, as its scriptures blaze with the fury of the infernal realms.",
        "When attuned to it, you know the {@spell eldritch blast} cantrip and can cast it using your spellcasting ability. The tome shoots out burning pages wrapped in chains for each of the beams. If three or more beams target the same creature, it must make a Strength saving throw or be {@condition grappled} till the end of its next turn. If targetted by 3 or more beams while {@condition grappled}, the creature must make another Strength saving throw or be {@condition restrained} for 1 minute. The tome can only restrain one creature at a time.",
        "The Lexicon contains a reservoir of 20 charges for the execution of its hellish edicts and powers.",
        {
          "type": "entries",
          "name": "Absolute Command",
          "entries": [
            "Using 5 charges, you forge a pact with any creature within 60 feet, compelling obedience with infernal authority. The target must make a Wisdom saving throw or become bound by the pact, on a success it deals {@dice 6d10} psychic damage and the pact ends. While under pact, the creature must use its action next turn follow the command issued by the pact, which can be a simple phrase like the ones listed in the {@spell command} spell."
          ]
        },
        {
          "type": "entries",
          "name": "Cataclysmic Hellfire",
          "entries": [
            "Expend 3 charges to unleash a devastating eruption of hellfire, casting a {@spell fireball} at the your current highest available spell slot without consuming it. You must have the spell slot unused. This hellfire, infused with the essence of the Nine Hells, radiates intense heat and malevolence. For each extra charge used, the {@spell fireball} grows in power, increasing its damage by {@dice 1d6} and radius by 5ft, harnessing ultimate wrath of the hell."
          ]
        },
        {
          "type": "entries",
          "name": "Arcane Sentinel",
          "entries": [
            "The Lexicon grants the bearer heightened sensitivity to magical pacts, oaths, and bindings, permitting them to use *detect magic* at will, without the need for a spell slot or expending a charge. This unique detection highlights the presence and specifics of any infernal contracts, bindings, or seals within its reach."
          ]
        }
      ]
    },
    {
      "name": "(Asmodeus) Ebony and Ivory, The Infernal Accords",
      "source": "AspysGuidetoInfinitum",
      "type": "R",
      "rarity": "divine arm",
      "weaponCategory": "martial",
      "age": "renaissance",
      "ammoType": "renaissance bullet",
      "property": [
        "AGI:DA",
        "AGI:AS",
        "AF",
        "RLD"
      ],
      "dmg1": "2d10",
      "dmgType": "Piercing",
      "range": "60/240",
      "reload": 6,
      "weapon": true,
      "firearm": true,
      "reqAttune": "by a devoted champion of Asmodeus",
      "weight": 3,
      "bonusWeapon": "+5",
      "entries": [
        "Ebony and Ivory, the Infernal Accords, are a pair of enchanted pistols that embody the duality of the hells. Order and chaos, punishment and temptation. Crafted from the bones of a celestial and the heart of a demon, these pistols are a testament the law enforced within the hells. Their barrels glow with eldritch runes, and they emit a soft, ominous hum when drawn.",
        "Wielding Ebony and Ivory grants a +5 bonus to attack and damage rolls, and each shot deals an additional {@dice 2d8} radiant or necrotic damage depending on the pistol, Ebony and Ivory respectively.",
        "You must hold both the pistols in each hand, otherwise suffering a -10 penalty to attack rolls if used seperately. When you make an extra attack, you can use the other pistol to make an additional attack. ",
        "The pistols hold a reservoir of 20 divine charges, used to unleash hellish fury upon the battlefield.",
        {
          "type": "entries",
          "name": "Hell's Barrage",
          "entries": [
            "As an action, expend 3 charges to unleash a barrage of hellfire bullets, targeting up to six creatures you can see within range. Make a ranged attack for each bullet. On a hit, each shot deals {@dice 4d10} fire damage instead of the weapon's damage dice."
          ]
        },
        {
          "type": "entries",
          "name": "Infernal Armament Transformation",
          "entries": [
            "Expend 8 charges as a bonus action to merge Ebony and Ivory into 'Hellfire's Fury', a minigun of devilish design with a capacity of {@dice 20d10} bullets. This transformation lasts for 1 minute or until all bullets are expended, whichever comes first.",
            "As an action while transformed, you can unleash a barrage of upto 50 bullets at one or multiple targets within range. Each bullet inflicts 3 piercing damage. Targets must make a Dexterity saving throw to take half damage; failing the save results in full damage from the barrage.",
            "Creatures who fail their saving throw by 5 or more are also frightened until the end of their next turn."
          ]
        },
        {
          "type": "entries",
          "name": "Arcane Sentinel",
          "entries": [
            "Ebony and Ivory fine-tune the wielder's senses to the presence of deals, contracts, and bindings, both divine and infernal. They can cast *detect magic* at will using 1 charge, with a specialized focus on revealing the nature and terms of any magical contract or binding within range."
          ]
        }
      ]
    }
  ],
  "itemProperty": [
    {
      "abbreviation": "AGI:AS",
      "source": "AspysGuidetoInfinitum",
      "entries": [
        {
          "type": "entries",
          "name": "Arcane Sentinel",
          "entries": [
            "You always know the spell {@spell detect magic} and can cast it at double the radius using 1 charge. On using another charge, the spell can sense through the barriers it is blocked by such as 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt."
          ]
        }
      ]
    },
    {
      "abbreviation": "AGI:A",
      "source": "AspysGuidetoInfinitum",
      "entries": [
        {
          "type": "entries",
          "name": "Arcane Sentinel",
          "entries": [
            "This Artifact has a pool of 15 charges to use its magical abilities. At the end of a long rest, roll a {@dice 1d20}. On a 20 you regain all charges and an additional 10(for a total of 25). On a 1, you regain 5 charges. Otherwise you regain {@dice 2d6+3} charges instead."
          ]
        }
      ]
    },
    {
      "abbreviation": "AGI:DA",
      "source": "AspysGuidetoInfinitum",
      "entries": [
        {
          "type": "entries",
          "name": "Arcane Sentinel",
          "entries": [
            "This Divine Arm has a pool of 20 charges to use its magical abilities. At the end of a long rest, roll a {@dice 1d20}. On a 19 and up you regain all charges and an additional 10(for a total of 30). On a 1, you regain 5 charges. Otherwise you regain {@dice 2d6+3} charges instead."
          ]
        }
      ]
    }
  ]
}
